<a href="https://colab.research.google.com/github/kim-star/DataScience/blob/master/210812_%EB%B6%80%EC%82%B0%EB%8C%80%ED%95%99%EA%B5%90_Pandas%EC%8B%A4%EC%8A%B5_%EB%B0%B0%ED%8F%AC%EC%9A%A9%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas 시작하기

## 자료구조 Series

### Series 의 생성(1)

In [ ]:
# 리스트 데이터로 Series 객체 생성하기
#  _____ 란에 실습을 시작하세요.

year = ['2019', '2020', '2021', '2022']
result = ________________

print('\nType:', type(result))
print(result)

In [ ]:
# Series 객체의 주요 속성
print('Index: ', __________ )
print('Data: ', __________ )
print('DType: ', __________ )
print('Shape: ', __________ )

In [ ]:
# Series 객체의 이름 지정
 _____________ = 'Year'
 _____________ = 'No.'
print(result)

### Series 의 생성(2)

In [ ]:
# 인덱스 추가하여 Series 객체 생성하기
year = ['2019', '2020', '2021', '2022']
idx = ['a', 'b', 'c', 'd']

result = __________________________ 
print(result)

### Series 의 생성(3)

In [ ]:
# 딕셔너리 데이터로 Series 객체 생성하기
score = {'Kim':85, 'Han':89, 'Lee':99, 'Choi':70}

result = __________________________
print(result)

## 자료구조 DataFrame

### DataFrame 의 생성(1)

In [ ]:
# 파이썬 딕셔너리 객체 이용하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}
        
df = __________________
print(type(df))
print(df)

In [ ]:
# DataFrame 주요 속성 실습-1
print('-Index: ', ________)
print('-Columns: ', ________)
print('-Values:', ________)

In [ ]:
# DataFrame 주요 속성 실습-2
print('-DTypes: ', ________)
print('-Shape: ', ________)

### DataFrame 의 생성(2)

In [ ]:
# index, columns 지정하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}     
i = ['a', 'b', 'c', 'd']
c = ['score', 'grade', 'name', 'email']
        
df = ______________________________
print(df)

## DataFrame 살펴보기

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
print(score_df)

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

* info(), head(), tail(), sample() 실습

In [ ]:
print(score_df.head(3))

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python

In [ ]:
score_df.tail(2)

    name  score grade subject
3  Jessi     85     B       c
4    Tom     97     A    java

In [ ]:
score_df.sample(2, random_state=10)

    name  score grade subject
2   Alex     80     B  python
3  Jessi     85     B       c

In [ ]:
score_df.sample(frac=0.5)

    name  score grade subject
3  Jessi     85     B       c
1   Emma     95     A    java

## 수치형과 범주형 데이터의 이해

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'age': [20, 24, 23, 20, 27],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
print(score_df)

    name  age  score grade subject
0  Jessi   20    100     A  python
1   Emma   24     95     A    java
2   Alex   23     80     B  python
3  Jessi   20     85     B       c
4    Tom   27     97     A    java

In [ ]:
# describe() 함수 실습
print("Generate Descriptive Statistics")
#____________________
score_df.describe()

Generate Descriptive Statistics

             age       score
count   5.000000    5.000000
mean   22.800000   91.400000
std     2.949576    8.502941
min    20.000000   80.000000
25%    20.000000   85.000000
50%    23.000000   95.000000
75%    24.000000   97.000000
max    27.000000  100.000000

In [ ]:
# 범주형 데이터에 대한 describe() 함수 실습

print("Generate Descriptive Statistics for Categorical")
#____________________
#score_df[['grade', 'subject']].describe()
score_df.describe(include='all')

Generate Descriptive Statistics for Categorical

         name        age       score grade subject
count       5   5.000000    5.000000     5       5
unique      4        NaN         NaN     2       3
top     Jessi        NaN         NaN     A    java
freq        2        NaN         NaN     3       2
mean      NaN  22.800000   91.400000   NaN     NaN
std       NaN   2.949576    8.502941   NaN     NaN
min       NaN  20.000000   80.000000   NaN     NaN
25%       NaN  20.000000   85.000000   NaN     NaN
50%       NaN  23.000000   95.000000   NaN     NaN
75%       NaN  24.000000   97.000000   NaN     NaN
max       NaN  27.000000  100.000000   NaN     NaN

In [ ]:
# 범주형 데이터를 위한 unique() 함수 실습
print("The Unique Values")
#____________________
score_df['subject'].unique()

The Unique Values

array(['python', 'java', 'c'], dtype=object)

In [ ]:
# 범주형 데이터를 위한 value_counts() 함수 실습
print("The Value Counts")
#____________________
#score_df['subject'].value_counts()
score_df['subject'].value_counts(normalize=True)

The Value Counts

java      0.4
python    0.4
c         0.2
Name: subject, dtype: float64

## 데이터 조회 및 변경

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
print(df)

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# 인덱싱 기법으로 열 데이터 조회 실습
print('Columns : name')
#_______________
df['name']

Columns : name

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# . 연산자로 열 데이터 조회 실습
print('Columns : name')
#_______________
df.name

Columns : name

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# df.name 의 타입 출력하여 확인
print('Type:', type(df.name))

In [ ]:
# 다중 열 데이터 조회 실습
print('Columns : name-subject-grade')
#_____________________
df[['name', 'subject', 'grade']]

Columns : name-subject-grade

    name subject grade
0  Jessi  python     A
1   Emma    java     A
2   Alex  python     B
3  Jessi       c     B
4    Tom    java     A

In [ ]:
# etc 열 데이터 변경하기
print('Modify Column Data')
#_____________________
#df['etc']=0
df.drop(etx)

Modify Column Data

NameError: ignored

In [ ]:
# loc 이용하여 행 데이터 조회 실습
print('Rows-1')
#_____________________
df.loc[1]

Rows-1

name       Emma
subject    java
score        95
grade         A
etc           0
etx           0
Name: 1, dtype: object

In [ ]:
# loc 이용하여 다중 행 데이터 조회 실습
print('Rows-0,2,4')
df.loc[[0,2,4]]

Rows-0,2,4

    name subject  score grade  etc  etx
0  Jessi  python    100     A    0    0
2   Alex  python     80     B    0    0
4    Tom    java     97     A    0    0

In [ ]:
# 특정 행 데이터 변경 실습
print('Modify Rows0')
df.loc[0] = ['Jessi', 'java', 70, 'C', 1,0]
df

Modify Rows0

    name subject  score grade  etc  etx
0  Jessi    java     70     C    1    0
1   Emma    java     95     A    0    0
2   Alex  python     80     B    0    0
3  Jessi       c     85     B    0    0
4    Tom    java     97     A    0    0

In [ ]:
# 행과 열의 조건을 동시에 지정하여 조회 실습
row_idx = [1,2,4]
col_idx = ['name', 'subject', 'grade']

print('Rows & Columns')
df.loc[row_idx, col_idx]

Rows & Columns

   name subject grade
1  Emma    java     A
2  Alex  python     B
4   Tom    java     A

## 데이터 추가, 삭제

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
print(df)

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# Series 객체 생성하여 'semester' 라는 열 추가
semester_data = pd.Series(['20-01', '20-01', '20-02', '20-01'])
df['semester'] = semester_data

print('Add Columns : semester')
df

Add Columns : semester

    name subject  score grade  etc semester
0  Jessi  python    100     A  NaN    20-01
1   Emma    java     95     A  NaN    20-01
2   Alex  python     80     B  NaN    20-02
3  Jessi       c     85     B  NaN    20-01
4    Tom    java     97     A  NaN      NaN

In [ ]:
# 연산 이용하여 'high_score' 라는 열 추가
df['high_score'] = df['score']>90 #boolean

print('Add Columns : high_score')
df

Add Columns : high_score

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True

In [ ]:
# 6 번 인덱스에 행 데이터 추가
df.loc[6] = ['Jina', 'python', 100, 'A', 1, '20-02', True]

print('Add Row 6')
df

Add Row 6

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True
6   Jina  python    100     A    1    20-02        True

In [ ]:
# 1) drop() 이용하여 행 데이터 삭제
# 2) inplace 인자를 사용하여 원본 데이터에 바로 삭제

#df.drop(6)

df.drop(6, inplace=True)
print('Delete Row : 6')
df

Delete Row : 6

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True

In [ ]:
# drop() 이용하여 'etc' 열 삭제 (원본데이터변경)
df.drop(columns=['etc'], inplace=True)

print('Delete Column :')
df

Delete Column :

    name subject  score grade semester  high_score
0  Jessi  python    100     A    20-01        True
1   Emma    java     95     A    20-01        True
2   Alex  python     80     B    20-02       False
3  Jessi       c     85     B    20-01       False
4    Tom    java     97     A      NaN        True

## 데이터 파일 읽기

In [ ]:
filepath = '/content/sample_data/mnist_train_small.csv'

titanic_df = pd.read_csv(filepath)
type(titanic_df)

pandas.core.frame.DataFrame

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
!unzip -qq '/dataset_1.zip'

checkdir error:  cannot create dataset_1
                 File exists
                 unable to process dataset_1/.
checkdir error:  cannot create dataset_1
                 File exists
                 unable to process dataset_1/students_score.xlsx.
checkdir error:  cannot create dataset_1
                 File exists
                 unable to process dataset_1/titanic.csv.

In [ ]:
# info() 확인해보기
print('Summary of DataFrame')
____________________

In [ ]:
# sample 데이터 출력해보기
print('Return the first n rows')
print(titanic_df.head())

Return the first n rows
   6  0  0.1  0.2  0.3  0.4  ...  0.585  0.586  0.587  0.588  0.589  0.590
0  5  0    0    0    0    0  ...      0      0      0      0      0      0
1  7  0    0    0    0    0  ...      0      0      0      0      0      0
2  9  0    0    0    0    0  ...      0      0      0      0      0      0
3  5  0    0    0    0    0  ...      0      0      0      0      0      0
4  2  0    0    0    0    0  ...      0      0      0      0      0      0

[5 rows x 785 columns]

In [ ]:
# 엑셀 파일에서 데이터 읽기
filepath2 = '/content/sample_data/students_score.xlsx'
print('Read students_score.xlsx')
sample_df = pd.read_excel(filepath2)
sample_df

Read students_score.xlsx

   Jessi  20  100  A  python
0   Emma  24   95  A    java
1   Alex  23   80  B  python
2  Jessi  20   85  B       c
3    Tom  27   97  A    java
4    Sia  28   79  C  python

In [ ]:
# 1) header=none 옵션으로 컬럼 없이 데이터 읽기
# 2) df.columns 에 새로운 컬럼명 저장하기
sample_df = pd.read_excel(filepath2, header = 2)
sample_df.columns = ['name', 'age', 'score', 'grade', 'subject']

print('Read Excel by header=none')
sample_df

Read Excel by header=none

    name  age  score grade subject
0  Jessi   20     85     B       c
1    Tom   27     97     A    java
2    Sia   28     79     C  python

In [ ]:
# 'students' sheet 에 있는 데이터 읽기
print('Read Excel on students sheet')
student_df =pd.read_excel(filepath2, sheet_name='students')
student_df

Read Excel on students sheet

    name  age  etc1  etc2  etc3                email
0    Lee   25   0.1   0.1   0.1    lee@codepresso.kr
1  Hwang   24   0.1   0.1   0.1  hwang@codepresso.kr
2    Kim   28   0.1   0.1   0.1    kim@codepresso.kr
3   Choi   27   0.1   0.1   0.1   choi@codepresso.kr
4   Park   21   0.1   0.1   0.1   park@codepresso.kr
5    Lim   20   0.1   0.1   0.1    lim@codepresso.kr

## 데이터 전처리(1)

* 샘플데이터 생성

In [ ]:
import pandas as pd
import numpy as np

# 실습 데이터 생성
df = pd.DataFrame(data = np.arange(18).reshape(6,3),
				  index = ['a','b','c','d','e','f'],
                  columns=['col1','col2','col3'])
                  
df['col4'] = pd.Series(data = [1.7, 1.2, 2.4], 
                       index = ['a','e','c'])
df.loc['c'] = None

# 실습 데이터 출력
print(df)

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
c   NaN   NaN   NaN   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [ ]:
# df.info() 함수로 결측치 유무 확인하기
print('#1 Summary of DataFrame')
df.info()

#1 Summary of DataFrame
<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
 3   col4    2 non-null      float64
dtypes: float64(4)
memory usage: 400.0+ bytes

In [ ]:
# df.isnull() 함수로 결측치 유무 확인하기
print('#2 isnull of DataFrame')
df.isnull()

#2 isnull of DataFrame

    col1   col2   col3   col4
a  False  False  False  False
b  False  False  False   True
c   True   True   True   True
d  False  False  False   True
e  False  False  False  False
f  False  False  False   True

In [ ]:
print('#4 Sum of all missing values per columns')
df.isnull().sum()

#4 Sum of all missing values per columns

col1    1
col2    1
col3    1
col4    4
dtype: int64

In [ ]:
print('#5 Sum of all missing values per rows')
df.isnull().sum(axis=1)

#5 Sum of all missing values per rows

a    0
b    1
c    4
d    1
e    0
f    1
dtype: int64

## 데이터 전처리(2)

In [ ]:
# 행을 기준으로 결측치 조회하여 제거하기
print('#1 Remove missing values')
_________________________

In [ ]:
# 원본데이터에 반영
print('#2 Remove missing values with inpalce=True')
_________________________
_________________________

In [ ]:
# 열을 기준으로 결측치 조회하여 제거하기
print('#3 Remove missing values in columns')
_________________________

In [ ]:
# 실습 데이터 추가
df.iloc[:2, 0] = np.nan
df.iloc[:4, 1] = np.nan
print(df)

In [ ]:
# 결측값을 0 으로 대체하기
print('#4 Replace missing values')
_________________________

In [ ]:
# 딕셔너리를 활용한 컬럼별 대체값 지정하기
print('#5 Replace missing values')
replace_set = {'col2':0, 'col4':'100'}
_________________________

In [ ]:
print('#6 Replace missing values')
replace_set = {'col1':df['col1'].mean()}
_________________________